app/controllers/categories_controller.rb

SELECT "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "categories" ("category", "tool_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category", nil], ["tool_id", 2], ["created_at", "2023-08-10 04:13:14.596295"], ["updated_at", "2023-08-10 04:13:14.596295"]]
---
    def create
        @tool = Tool.find(params[:tool_id])
        @category = @tool.categories.create(category_params)