app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools"
---
  def index
    @tools = Tool.all

SELECT "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tool = Tool.find(params[:id])

INSERT INTO "tools" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tools R Us"], ["description", "Tool this !!!!!!"], ["created_at", "2023-08-10 03:47:02.082933"], ["updated_at", "2023-08-10 03:47:02.082933"]]
---
  def create
    @tool = Tool.new(tool_params)
    if @tool.save

SELECT "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @tool = Tool.find(params[:id])

SELECT "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "tools" SET "description" = ?, "updated_at" = ? WHERE "tools"."id" = ?  [["description", "I am on Rails! OR NOT"], ["updated_at", "2023-08-10 03:54:28.771552"], ["id", 3]]
---
  def update
    @tool = Tool.find(params[:id])
    if @tool.update(tool_params)

SELECT "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tools" WHERE "tools"."id" = ?  [["id", 3]]
---
  def destroy
    @tool = Tool.find(params[:id])
    @tool.destroy